tobozo/esp32-DCF77_Analyzer_Clock/UI.h
#ifndef _UI_H_
#define _UI_H_

#include <ESP32-Chimera-Core.h> // https://github.com/tobozo/ESP32-Chimera-Core or regular M5Stack Core
#define tft M5.Lcd // syntax sugar

#include "Config.h"
#include "SpriteSheet.h"


#ifdef DCF77_DO_WEATHER
  #include <Preferences.h>
  Preferences prefs;
  static int maxEntriesPerPage = 10;
  static int entriesIndex = -1;
  static bool pickedCity = false;
  static unsigned long pickerTimeout = 5000;
  static unsigned long beforePicking = millis();
  String preferredCountry = "";
  String preferredCity = "";
#endif

#ifdef USE_RTC
  #include "DS1307RTC.h" // a custom DS1307 library that returns time as a time_t
  DS1307RTC RTC;
#else
  #include <Time.h>
#endif

#ifdef SPEAKER_PIN
  SPEAKER Speaker;
#endif

#define freeheap heap_caps_get_free_size( MALLOC_CAP_INTERNAL )

static xSemaphoreHandle mux = NULL; // this is needed to prevent rendering collisions
// between scrollpanel and heap graph
#define takeMuxSemaphore() if( mux ) { xSemaphoreTake( mux, portMAX_DELAY ); log_v( "Took Semaphore" ); }
#define giveMuxSemaphore() if( mux ) { xSemaphoreGive( mux ); log_v( "Gave Semaphore" ); }


// this is just lgfx::TextStyle with a constructor
struct TextStyle {
  std::uint32_t fore_rgb888 = 0xFFFFFFU;
  std::uint32_t back_rgb888 = 0;
  float size_x = 1;
  float size_y = 1;
  textdatum_t datum = textdatum_t::top_left;
  bool utf8 = true;
  bool cp437 = false;
  // constructor
  TextStyle( std::uint32_t _fore_rgb888, std::uint32_t _back_rgb888, float _size_x, float _size_y, textdatum_t _datum, bool _utf8, bool _cp437 ) :
    fore_rgb888( _fore_rgb888 ), back_rgb888( _back_rgb888 ), size_x( _size_x ), size_y( _size_y ), datum( _datum ), utf8( _utf8 ), cp437( _cp437 ) { }
};

struct FontStyle {
  const lgfx::IFont* font;
  TextStyle *style;
  // constructor
  FontStyle( const lgfx::IFont *_font, TextStyle *_style ) : font( _font ), style( _style ) { }
  // style setter
  void setTextStyle( TextStyle *_style ) {
    style = _style;
  }
};


struct BoxStyle {
  const std::uint32_t fillColor;
  FontStyle* style;
  BoxStyle( const std::uint32_t  f, FontStyle *s ) : fillColor(f), style(s) { }
};


// helper for setFontStyle
void setTextStyle( TFT_eSprite *sprite, TextStyle *style ) {
  lgfx::TextStyle myStyle; // why no constructor ??
  myStyle.fore_rgb888 = style->fore_rgb888;
  myStyle.back_rgb888 = style->back_rgb888;
  myStyle.size_x = style->size_x;
  myStyle.size_y = style->size_y;
  myStyle.datum = style->datum;
  myStyle.utf8 = style->utf8;
  myStyle.cp437 = style->cp437;
  sprite->setTextStyle( myStyle );
}

void setFontStyle( TFT_eSprite *sprite, FontStyle *myFontStyle ) {
  sprite->setFont( myFontStyle->font );
  setTextStyle( sprite, myFontStyle->style );
}



#if defined( ARDUINO_M5Stack_Core_ESP32 ) || defined( ARDUINO_M5STACK_FIRE )
  #include "UI_320x240.h"
#else
  #include "UI_160x128.h"
#endif

#include "DCF77.h"


static TFT_eSprite sprite = TFT_eSprite( &tft );

#ifdef DCF77_DO_WEATHER
  static TFT_eSprite ScrollSprite = TFT_eSprite( &tft );
#endif
static TFT_eSprite MainSprite = TFT_eSprite( &tft );
static TFT_eSprite MaskSprite = TFT_eSprite( &tft );
static TFT_eSprite LogoSprite = TFT_eSprite( &tft );

static uint16_t TFT_HALFWIDTH;//    tft.width()/2
static uint16_t TFT_HALFHEIGHT;//   tft.height()/2
static uint16_t RingLabelsFontHeight = 0;
static uint16_t RingLabelsFontWidth  = 0;
static uint16_t ErrorsCountFontHeight = 0;
static uint16_t ErrorsCountFontWidth  = 0;
static uint16_t tmpFontHeight = 0;
static uint16_t tmpFontWidth  = 0;
static uint16_t LedWeekStatusFontWidth = 0;
static uint16_t LedWeekStatusFontHeight = 0;
static uint16_t LedErrorStatusFontWidth = 0;
static uint16_t LedErrorStatusFontHeight = 0;
static uint16_t LedParityStatusFontWidth = 0;
static uint16_t LedParityStatusFontHeight = 0;
static uint16_t LedDCFStatusFontWidth = 0;
static uint16_t LedDCFStatusFontHeight = 0;
static uint16_t LedDisplayFontHeight = 0;
//static uint16_t BufferFontHeight = 0;
static uint16_t RTCDateFontHeight = 0;

//static uint16_t timeColor;

static uint16_t weekDayNamesWidth = 0;
static uint16_t CETWidth = 0;
static uint16_t CETXPos = 0;
static uint16_t CESTWidth = 0;
static uint16_t CESTXpos = 0;
static uint16_t LEAPWidth = 0;
static uint16_t LEAPXPos = 0;

int16_t  x, y;
uint16_t w, h;

float MinuteSteps = ( TWO_PI / 60 ) / 5;

float r1 = float_r1; // inner ring
float r2 = float_r2; // outer ring
float r3 = float_r3; // inner 10's mark
float r4 = float_r4; // inner 10's label

enum UIModes {
  DCF_CLOCK, // default
  #ifdef DCF77_DO_WEATHER
  DCF_SETUP,
  #endif
  COOK_TIMER // bonus ^^
};

UIModes UIMode = DCF_CLOCK;
//UIModes UIMode = COOK_TIMER;


#ifdef DCF77_DO_WEATHER
  static String scrollText = "blah bleh blih bloh bluh blyh blah bleh blih bloh bluh blyh ";
  static uint16_t scrollWidth;
  static uint16_t scrollHeight;
  static int scrollPos = 0;
  //static int scrollFontSize = int_scrollFontSize;
  //static bool isScrolling = false;
  //static uint16_t scrollFontColor;
  static uint16_t scrollFontColorDisabled = TFT_DARKGRAY;
  static uint16_t scrollFontColorEnabled = TFT_GRAY;
#endif

//void sprite_drawJpg( TFT_eSprite *spr, int16_t x, int16_t y, const uint8_t * jpg_data, size_t jpg_len, uint16_t maxWidth, uint16_t maxHeight );


void tft_drawSpriteSheet( SpriteSheetIcon icon, uint16_t x=0, uint16_t y=0 ) {
  uint16_t offsetx = (icon%16)*32;
  uint16_t offsety = (icon/16)*32;
  tft.drawJpg( sprite_jpg, sprite_jpg_len, x, y, 32, 32, offsetx, offsety );
}
void sprite_drawSpriteSheet( TFT_eSprite &sprite, SpriteSheetIcon icon, uint16_t x=0, uint16_t y=0 ) {
  uint16_t offsetx = (icon%16)*32;
  uint16_t offsety = (icon/16)*32;
  //log_e("sprite.drawSpriteSheet( %d, %d, %d, %d, %d, %d );", x, y, 32, 32, offsetx, offsety );
  sprite.fillRect( x, y, 32, 32, TFT_BLACK );
  sprite.drawJpg( sprite_jpg, sprite_jpg_len, x, y, 32, 32, offsetx, offsety );
  //log_e("done");
}

static void getTextBounds( TFT_eSprite *sprite, const char *string, uint16_t *w, uint16_t *h ) {
  *w = sprite->textWidth( string );
  *h = sprite->fontHeight();
}


#include "CookTimer.h"
#include "Tasks.h"


#if defined( BUTTON_A_PIN ) &&  defined( BUTTON_B_PIN ) &&  defined( BUTTON_C_PIN )

  void checkButtons() {
    //static byte longPushCounter = 0;
    M5.update();
    if ( longPushCounter >= 30 /*|| M5.BtnC.pressedFor( 1000 )*/ ) {
      longPushCounter = 0;
      // long press = switch UI mode
      switch( UIMode ) {
        #ifdef DCF77_DO_WEATHER
          case DCF_SETUP:
            // TODO: find something to do with long press when in setup mode :-)
          break;
        #endif
        case DCF_CLOCK:
          UIMode = COOK_TIMER;
          cookTimerSetup();
        break;
        case COOK_TIMER:
          UIMode = DCF_CLOCK;
          cookTimerStop();
        break;
      }
      // wait for button release
      while( M5.BtnC.isPressed() ) M5.update();
    }
    switch( UIMode ) {
      #ifdef DCF77_DO_WEATHER
        case DCF_SETUP:
          if ( M5.BtnA.wasPressed() ) { entriesIndex--; pickerTimeout = 600000; beforePicking = millis(); log_w("entriesIndex : %d", entriesIndex ); }
          if ( M5.BtnB.wasPressed() ) { entriesIndex++; pickerTimeout = 600000; beforePicking = millis(); log_w("entriesIndex : %d", entriesIndex ); }
          if ( M5.BtnC.wasPressed() ) pickedCity = true;
        break;
      #endif
      case DCF_CLOCK:
        if( M5.BtnC.isPressed() ) longPushCounter++;
        else longPushCounter = 0;
        if ( M5.BtnA.wasPressed() ) ESP.restart();
        if ( M5.BtnB.wasPressed() ) dcf77SoundSwitch = 1 - dcf77SoundSwitch;
      break;
      case COOK_TIMER:
        if( M5.BtnC.isPressed() ) { longPushCounter++; CookTimerButtonPos = BUTTON_CLICK; }
        else if( M5.BtnB.isPressed() ) { longPushCounter = 0; CookTimerButtonPos = BUTTON_RIGHT; }
        else if( M5.BtnA.isPressed() ) { longPushCounter = 0; CookTimerButtonPos = BUTTON_LEFT; }
        else { longPushCounter = 0; CookTimerButtonPos = BUTTON_NEUTRAL; }
      break;
    }
    //delay(50);
  }

#else
  void checkButtons() { ; }
#endif


#ifdef DCF77_DO_WEATHER

