tobozo/esp32-DCF77_Analyzer_Clock/UI.h
  static void updateIcons( SpriteSheetIcon icon1, SpriteSheetIcon icon2, SpriteSheetIcon icon3 ) {
    needrendering = 0;
    uint16_t posx = ( TFT_HALFWIDTH - 32 / 2 );
    uint16_t posy = ( TFT_HALFHEIGHT - 32 / 2 );

    if( icon1 != nullicon && icon1 != lasticon1 ) {
      lasticon1 = icon1;
      needrendering++;
      drawIconTask( icon1, posx-32, posy );
      log_w("Icon1 will be rendererd with #%d", icon1 );
    }
    if( icon2 != nullicon && icon2 != lasticon2 ) {
      lasticon2 = icon2;
      needrendering++;
      drawIconTask( icon2, posx, posy );
      log_w("Icon2 will be rendererd with #%d", icon2 );
    }
    if( icon3 != nullicon && icon3 != lasticon3 ) {
      lasticon3 = icon3;
      needrendering++;
      drawIconTask( icon3, posx+32, posy );
      log_w("Icon3 will be rendererd with #%d", icon3 );
    }
    if( needrendering > 0 ) {
      while( needrendering > 1 ) {
        takeMuxSemaphore();
        sprite.pushSprite( 0, 0 );
        giveMuxSemaphore();
        vTaskDelay( 10 );
      }
    }
  }


  void setupScroll() {

    takeMuxSemaphore();
    ScrollSprite.createSprite( tft.width(), scrollHeight );
    //ScrollSprite.fillSprite( TFT_BLACKISH );
    //ScrollSprite.setTextColor( scrollFontColor, TFT_BLACKISH );
    scrollFontStyle->setTextStyle( scrollStyleDisabled );
    setFontStyle( &ScrollSprite, scrollFontStyle );
    giveMuxSemaphore();

    takeMuxSemaphore();
    MaskSprite.createSprite( tft.width(), scrollHeight );
    MaskSprite.fillSprite( TFT_BLACK );
    MaskSprite.setSwapBytes( true );
    giveMuxSemaphore();
  }

  void unsetupScroll() {
    MaskSprite.deleteSprite();
    ScrollSprite.deleteSprite();
  }


  void initScroll( String text/*="                             Meteo is loading" */ ) {
    scrollText = text;
    scrollPos = 0;
    //scrollFontSize = int_scrollFontSizeSmall;
    //scrollFontColor = scrollFontColorDisabled;
    scrollFontStyle->setTextStyle( scrollStyleDisabled );
    /*
    takeMuxSemaphore();
    uint16_t* mainSpritePtr = (uint16_t*)MainSprite.createSprite( tft.width(), tft.height() );
    if( mainSpritePtr == NULL ) {
      log_e("Unable to create mainSpritePtr");
    } else {
      log_n("Successfully created mainSpritePtr");
    }
    MainSprite.fillSprite( TFT_BLACK );
    MainSprite.setSwapBytes( true );
    giveMuxSemaphore();*/

    setFontStyle( &ScrollSprite, scrollFontStyle );
    //tft_setFont( scrollFontSize, ScrollSprite );
    getTextBounds( &sprite, scrollText.c_str(), &scrollWidth, &scrollHeight );

    setupScroll();
    unsetupScroll();
  }


  void updateScroll( String text ) {
    scrollText = text;
    scrollPos = 0;
    //scrollFontSize = int_scrollFontSize;
    //scrollFontColor = scrollFontColorEnabled;
    scrollFontStyle->setTextStyle( scrollStyleEnabled );
    //MaskSprite.deleteSprite();
    //ScrollSprite.deleteSprite();
    //setupScroll();
  }


  void handleScroll() {
    if ( scrollWidth <= 0 ) {
      Serial.println("Skipping zero width scroll");
      return;
    }
    setupScroll();

    takeMuxSemaphore();
    /*
    tft_setFont( scrollFontSize, ScrollSprite );
    ScrollSprite.drawString( scrollText, scrollPos, 0 );
    ScrollSprite.drawString( scrollText, scrollWidth + scrollPos, 0 );*/
    //scrollFontStyle->setTextStyle( );
    //setFontStyle( &ScrollSprite, scrollFontStyle );
    //ScrollSprite.fillSprite( TFT_GREEN );
    ScrollSprite.drawString( scrollText, scrollPos, 0 );
    giveMuxSemaphore();

    takeMuxSemaphore();
    MaskSprite.pushImage( 0, -tft.height() / 2 + scrollHeight / 2, tft.width(), tft.height(), (const uint16_t*)sprite.frameBuffer(1), TFT_BLACK );
    //MaskSprite.pushImage( ( TFT_HALFWIDTH - 32 / 2 ), ( TFT_HALFHEIGHT - 32 / 2 ), 32, 32, (const uint16_t*)LogoSprite.frameBuffer(1) );
    //MaskSprite.pushImage( ( TFT_HALFWIDTH - 32 / 2 ), ( TFT_HALFHEIGHT - 32 / 2 ), 32, 32, (const uint16_t*)LogoSprite.frameBuffer(1) );
    MaskSprite.pushRotated( &ScrollSprite, 0, TFT_BLACK );
    //MaskSprite.pushRotatedHP( &ScrollSprite, 0, TFT_BLACK );

    //ScrollSprite.pushImage( 0, 0, MaskSprite.width(), MaskSprite.height(), (const uint16_t*)MaskSprite.frameBuffer(1) );

    giveMuxSemaphore();

    takeMuxSemaphore();
    MainSprite.pushImage( 0, tft.height() / 2 - scrollHeight / 2, tft.width(), scrollHeight, (const uint16_t*)ScrollSprite.frameBuffer(1), TFT_BLACK );
    giveMuxSemaphore();
    scrollPos -= scrollSpeed;
    if ( scrollPos <= -scrollWidth ) {
      scrollPos = 0;
    }

    unsetupScroll();
  }

#endif



void displayBufferPosition( int dcfBit ) {
  takeMuxSemaphore();

  setFontStyle( &sprite, LedDisplayFontStyle );
  w = sprite.textWidth( "0" );
  sprite.setTextColor( TFT_RED, TFT_DARKGRAY );
  sprite.drawString( dcfBit ? "1" : "0", tft.width() - w, LedDisplayFontHeight + 2 );

  char bufferPosStr[3];
  sprintf( bufferPosStr, "%02d", bufferPosition );
  w = sprite.textWidth( "000" );
  sprite.setTextColor( TFT_GREEN, TFT_DARKGRAY );
  sprite.drawString( bufferPosStr, tft.width() - (w + 1), LedDisplayFontHeight + 1 );

  giveMuxSemaphore();
}


void LedDisplay( int addr, String leftOrRight, int value ) {
  int shift;
  ( leftOrRight == "L" ? shift = 4 : shift = 0 );
  //Now print the number digit by digit
  //preceding zero's are removed with tenary operator by 'printing' a space character.
  uint16_t xpos = 0;
  takeMuxSemaphore();
  switch ( addr ) {
    case DisplayPeriodPulse:
      char pulseStr[10];
      switch ( shift ) {
        case 4: // Right
          LedDisplayFontStyle->setTextStyle( LedDisplayStylePingtime );
          setFontStyle( &sprite, LedDisplayFontStyle );
          w = sprite.textWidth( "0000000" );
          sprintf( pulseStr, "%4d", value );
          xpos = tft.width() - (w + 1);
        break;
        case 0: // Left
          LedDisplayFontStyle->setTextStyle( LedDisplayStyleLeftover );
          setFontStyle( &sprite, LedDisplayFontStyle );
          w = sprite.textWidth( "000" );
          sprintf( pulseStr, "%3d", value );
          xpos = tft.width() - w;
        break;
      }
      sprite.drawString( pulseStr, xpos, 0 );
      sprite.fillCircle( TFT_HALFWIDTH - 1, TFT_HALFHEIGHT - 1, 1, second() % 2 == 0 ? TFT_RED : TFT_WHITE );
      //tft.fillCircle( 80, 55, 1, second() % 2 == 0 ? TFT_WHITE : TFT_RED );
    break;
    case DisplayBufferBitError:
      {
        char errorStr[12];
        if (value > 99) value = 99;
        sprintf( errorStr, "E:%02d", value );
        ErrorsCountFontStyle->setTextStyle( (value==0) ? ErrorsCountStyleOK : ErrorsCountStyleKO );
        setFontStyle( &sprite, ErrorsCountFontStyle );
        w = sprite.textWidth( errorStr  );
        sprite.fillRect( tft.width() - (w + 3), ErrorsCountFontHeight * 2 + 2, w + 2, ErrorsCountFontHeight + 1, TFT_DARKGRAY );
        sprite.drawString( errorStr, tft.width() - (w + 2), ErrorsCountFontHeight * 2 + 2 );
      }
    break;
    default:
      log_e( "Ignored addr: %d, value: %d", addr, value );
  }
  giveMuxSemaphore();
}


void LedDCFStatus( int status ) {
  uint16_t color = TFT_GRAY;
  switch ( status ) {
    case 0:
      LedDCFStatusFontStyle->setTextStyle( LedDCFStatusStyleKO );
      color = TFT_RED;
      break;
    case 1:
      LedDCFStatusFontStyle->setTextStyle( LedDCFStatusStyleOK );
      color = TFT_GREEN;
      break;
    case -1:
    default:
      //
      break;
  }
  takeMuxSemaphore();
  setFontStyle( &sprite, LedDCFStatusFontStyle );
  sprite.drawString( "DCF77", 0, 0 );
  giveMuxSemaphore();
}


void LedParityStatus( byte paritynum, int status ) {
  int xpos = 0;
  int ypos = ( tft.height() -  2 * LedParityStatusFontHeight ) - 2; // TODO: normalize this
  String out = " ";
  uint16_t color;

  switch ( paritynum ) {
    case 1: out = "M"; break;
    case 2: out = "S"; xpos = 12; break;
    case 3: out = "D"; xpos = 24; break;
    default: log_d( "invalid paritynum: %d", paritynum ); return;
  }
  switch (status) {
    case -1:
      color = TFT_LIGHTGRAY;
      LedParityStatusFontStyle->setTextStyle( LedParityStatusStyleNA );
      break;
    case 0:
      color = TFT_GREEN;
      LedParityStatusFontStyle->setTextStyle( LedParityStatusStyleOK );
      break;
    case 1:
      color = TFT_RED;
      LedParityStatusFontStyle->setTextStyle( LedParityStatusStyleKO );
      break;
    default:
      log_d( "invalid status for paritynum %d", paritynum );
      return;
  }
  takeMuxSemaphore();

  setFontStyle( &sprite, LedParityStatusFontStyle );
  sprite.drawString( out, xpos, ypos );
  giveMuxSemaphore();
}


