tobozo/esp32-DCF77_Analyzer_Clock/UI.h
  for ( uint8_t ledNum = 0; ledNum < 60; ledNum++ ) {
    float i = ( float( ledNum - 60 / 2 ) / 60 ) * TWO_PI;
    float x1, y1, x2, y2, x3, y3, x4, y4;
    x1 = ringLedCoords[0][ledNum].x;
    y1 = ringLedCoords[0][ledNum].y;
    x2 = ringLedCoords[1][ledNum].x;
    y2 = ringLedCoords[1][ledNum].y;
    x3 = ringLedCoords[2][ledNum].x;
    y3 = ringLedCoords[2][ledNum].y;
    x4 = ringLedCoords[3][ledNum].x;
    y4 = ringLedCoords[3][ledNum].y;
    uint16_t color1;
    if ( ledNum > 0 && ledNum < 15 ) { // meteo data
      color1 = tft.color565( 0x44, 0x22, 0x44);
    } else if ( ledNum > 14 && ledNum < 21 ) { // antenna / leap hour / CEST / CET / leap sec . start
      color1 = tft.color565( 0x22, 0x44, 0x44 );
    } else if ( ledNum > 20 && ledNum < 29 ) { // Minute
      color1 = tft.color565( 0x66, 0x22, 0x00 );
    } else if ( ledNum > 28 && ledNum < 36 ) { // Hour
      color1 = tft.color565( 0x44, 0x22, 0x44);
    } else if ( ledNum > 35 && ledNum < 42 ) { // Day
      color1 = tft.color565( 0x22, 0x44, 0x44 );
    } else if ( ledNum > 41 && ledNum < 45 ) { // Day Of Week
      color1 = tft.color565( 0x66, 0x22, 0x00 );
    } else if ( ledNum > 44 && ledNum < 50 ) { // Month
      color1 = tft.color565( 0x44, 0x22, 0x44);
    } else if ( ledNum > 49 && ledNum < 58 ) { // Year
      color1 = tft.color565( 0x22, 0x44, 0x44 );
    } else {                                  // Minute Marker
      color1 = tft.color565( 0x22, 0x66, 0x22 );
    }
    if ( ledNum % 10 == 0 ) {
      sprite.drawLine( x2, y2, x3, y3, TFT_LIGHTGRAY );
      sprite.drawString( String(ledNum).c_str(), x4, y4);
    }

    for ( float l = ledNum - 0.5; l <= ledNum + 0.5; l += MinuteSteps ) {
      i = ( float( l - 60 / 2) / 60) * TWO_PI;
      x1 = ( -sin(i) * r1 ) + TFT_HALFWIDTH;
      y1 = ( cos(i)  * r1 ) + TFT_HALFHEIGHT;
      x2 = ( -sin(i) * r2 ) + TFT_HALFWIDTH;
      y2 = ( cos(i)  * r2 ) + TFT_HALFHEIGHT;
      sprite.drawLine( x1, y1, x2, y2, color1 );
    }
  }

  giveMuxSemaphore();
}


void enableRing( byte ringNum, uint16_t color ) {
  for ( uint8_t ledNum = 0; ledNum < 60; ledNum++ ) {
    setRingLed( ringNum, ledNum, true, color );
  }
}

/* probably unused but kept for semantics */
void clearRing( byte ringNum ) {
  for ( uint8_t ledNum = 0; ledNum < 60; ledNum++ ) {
    setRingLed( ringNum, ledNum, false );
  }
}


void error( int errorLed ) {
  // no valid data
  dcfValidSignal = false;
  // turn 'dcfValidSignal = false on' and clear Led's/displays because of error condition
  LedErrorStatus( errorLed, HIGH );
  LedErrorStatus( LED_RTCSYNC, LOW );
  LedDCFStatus( false );
  // clearRing( LedRingOuter );
  // increase errorCounter and display errorCount
  errorCounter++;
  LedDisplay( DisplayBufferBitError, "R", errorCounter );
}


void displayRtcTime() {
  //byte fontAscent = 5;
  char timeStr[9];
  sprintf( timeStr, "%02d:%02d:%02d", hour(), minute(), second() );
  takeMuxSemaphore();
  setFontStyle( &sprite, myRTCTimeFontStyle );
  sprite.drawString( timeStr, TFT_HALFWIDTH, RTCTimeYPos );
  giveMuxSemaphore();
  log_i( "hh:mm:ss (%s) : %02d:%02d:%02d @ %d:%d [%d*%d]", timeStr, hour(), minute(), second(), x, y, w, h );
}


void displayRtcDate() {
  char dateStr[11];
  sprintf( dateStr, "%04d-%02d-%02d", year(), month(), day() );
  takeMuxSemaphore();
  setFontStyle( &sprite, myRTCDateFontStyle );
  sprite.drawString( dateStr, TFT_HALFWIDTH, RTCDateYPos );
  giveMuxSemaphore();

  uint16_t fontHeight = sprite.fontHeight();
  uint16_t textWidth = tft.textWidth( dateStr );

  timerBox.width  = textWidth  > timerBox.width  ? textWidth  : timerBox.width;
  timerBox.height = fontHeight > timerBox.height ? fontHeight : timerBox.height;
  timerBox.x      = TFT_HALFWIDTH - timerBox.width/2;
  timerBox.y      = RTCDateYPos - timerBox.height/2;
}


#ifdef SPEAKER_PIN
  void marioIntro() {
    //Mario main theme short intro
    uint16_t NOTE_C7 = 2093;
    uint16_t NOTE_E7 = 2637;
    uint16_t NOTE_G7 = 3136;
    int melody[] = {
      NOTE_E7, NOTE_E7, 0, NOTE_E7,
      0, NOTE_C7, NOTE_E7, 0,
      NOTE_G7, 0, 0,  0
    };
    int tempo = 12;
    int size = sizeof( melody ) / sizeof( int );
    for ( int thisNote = 0; thisNote < size; thisNote++ ) {
      int noteDuration = 1000 / tempo;
      Speaker.tone( melody[thisNote], noteDuration );
      int pauseBetweenNotes = noteDuration * 1.30;
      delay( pauseBetweenNotes );
      //Speaker.tone( 0, noteDuration );
      Speaker.mute();
    }
    Speaker.mute();

  }
#endif


void scheduleBuzz( uint16_t note, int duration ) {
  #ifdef SPEAKER_PIN
    willBuzzNote = note;
    willBuzzDuration = duration;
  #endif
}


#ifdef DCF77_DO_WEATHER

  char countryCityHolder[64];
  int citiesLength = 0;
  int halfPage = 0;

  void paginateCities() {

    if( entriesIndex < 0 ) {
      entriesIndex = citiesLength-1;
    }
    if( entriesIndex >= citiesLength ) {
      entriesIndex = 0;
    }

    int pageStart = entriesIndex - halfPage;
    int pageEnd   = entriesIndex + halfPage ;

    if( entriesIndex < halfPage ) {
      pageEnd+=halfPage;
    }

    if( pageEnd >= citiesLength ) {
      pageEnd = citiesLength-1;
    }
    if( pageStart < 0 ) {
      pageStart = 0;
    }

    log_d("Found %d cities, paginating from %d to %d (index=%d)", citiesLength, pageStart, pageEnd, entriesIndex );

    sprite.fillScreen( CountryCityFontStylePicoDisabled->style->back_rgb888 );

    uint8_t linenum = 0;

    for( int i=pageStart; i<=pageEnd; i++ ) {
      if( cities[i].name == nullptr ) continue;
      if( i == entriesIndex ) {
        setFontStyle( &sprite, CountryCityFontStylePicoEnabled );
      } else {
        setFontStyle( &sprite, CountryCityFontStylePicoDisabled );
      }
      sprintf( countryCityHolder, " %s : %s ", cities[i].country.name, cities[i].name );
      sprite.drawString( countryCityHolder, 0, linenum*RTCDateFontHeight );
      linenum++;
    }
    sprite.pushSprite( 0, 0/*, TFT_BLACK*/ );
  }


  void LoadCountryPref( const countryBycode* country ) {
    watchedCountry = (countryBycode*)country;
  }
  void LoadCityPref( const char* city ) {
    watchedCity = (char*)city;
  }


  void CountryCityWizard( unsigned long timeout ) {
    #ifndef USE_BUTTONS
      // TODO: handle serial input instead of blaming the lack of HID
      log_e("This feature requires buttons!");
      return;
    #endif
    maxEntriesPerPage = tft.height() / RTCDateFontHeight;
    halfPage = maxEntriesPerPage / 2;
    log_d("maxEntriesPerPage / citiesLength / halfPage : %d / %d / %d", maxEntriesPerPage, citiesLength, halfPage);
    for( int i=0; i<citiesLength; i++ ) {
      log_d("Index / Country / City: %d / %s / %s",  i, cities[i].country.name, cities[i].name );
    }
    UIMode = DCF_SETUP;
    beforePicking = millis();
    bool has_timed_out = false;
    pickerTimeout = timeout;
    while( !pickedCity ) {
      checkButtons();
      paginateCities();
      if( beforePicking + pickerTimeout < millis() ) {
        has_timed_out = true;
        break;
      }
    }
    if(  preferredCountry != String( cities[entriesIndex].country.name )
      || preferredCity    != String( cities[entriesIndex].name ) ) {
      // save only if choice changed
      log_w("Prefs have changed, saving!");
      prefs.begin("DCF77Prefs", false);
      prefs.putString( "country", cities[entriesIndex].country.name );
      prefs.putString( "city", cities[entriesIndex].name );
      prefs.end();
    }
    LoadCountryPref( &cities[entriesIndex].country );
    LoadCityPref( cities[entriesIndex].name );
    sprite.fillScreen( TFT_BLACK );
    sprite.pushSprite( 0, 0 );
    UIMode = DCF_CLOCK;
  }


  void InitPrefs() {
    prefs.begin("DCF77Prefs", true);
    preferredCountry = prefs.getString("country");
    preferredCity    = prefs.getString("city");
    prefs.end();

    citiesLength = ( sizeof(cities) / sizeof(cityByCountry) ) -1;

    if( preferredCountry != "" ) {
      log_w("Found preferredCountry '%s' in NVS, will compare with local list", preferredCountry.c_str() );
      const countryBycode* country = findCountryByName( preferredCountry.c_str() );
      if( country != nullptr ) {
        LoadCountryPref( country );
        if( preferredCity != "" ) {
          log_w("Found preferredCity '%s' in NVS, will compare with local list", preferredCity.c_str() );
          const char* city = findCityByName( preferredCity.c_str() );
          if( city != nullptr ) {
            LoadCityPref( city );
            for( int i=0; i<citiesLength; i++ ) {
              if( strcmp( city, cities[i].name )==0 && strcmp( country->name, cities[i].country.name )==0 ) {
                entriesIndex = i;
                CountryCityWizard( 5000 );
                return;
              }
            }
          } // else invalid city or end of array
        } // else empty city name returned from prefs
      } // else invalid country or end of array
    } // else empty country name returned from prefs
    CountryCityWizard( 600000 );
  }
#endif


void InitPins() {
  // initialize PIN connections
  pinMode( DCF77PIN,           INPUT );
  #ifdef DCF77_pdnPort
    pinMode( DCF77_pdnPort, OUTPUT );
    digitalWrite( DCF77_pdnPort, LOW );  // LOW=turn on radio
  #endif
  #ifdef DCF77_gainPort
    pinMode( DCF77_gainPort, OUTPUT );
    digitalWrite( DCF77_gainPort, HIGH );  // HIGH=turn on autogain
  #endif
}


void initSpeaker() {
  #ifdef SPEAKER_PIN
    // TONE
    Speaker.begin();
    Speaker.setVolume( 2 );
    marioIntro();
  #endif
}


void initRTC() {
  #ifdef USE_RTC
    Wire.begin( DS1307_SDA, DS1307_SCL );
    #ifdef _CHIMERA_CORE_
      M5.I2C.scan();
    #endif
    // Initialize RTC and set as SyncProvider.
    // Later RTC will be synced with DCF time
    RTC.begin( DS1307_SDA, DS1307_SCL );
    //delay(10);
    setSyncProvider( RTC.get );   // the function to get the time from the RTC
    //delay(500);
    // check if RTC has set the system time
    if ( timeStatus() != timeSet ) { // Unable to sync with the RTC - activate RTCError LED
      LedErrorStatus(LED_RTCERROR, HIGH);
      log_e( "RTC Time is not set! RTC.isrunning: %x", RTC.isrunning() );
      // use for test purposes and/or setting the RTC time manually
      //setTime(11, 15, 40, 13, 8, 19);
      //RTC.set(now());
    } else {
      // RTC has set the system time - dim RTCError LED
      LedErrorStatus( LED_RTCERROR, LOW );
      log_d( "hh:mm:ss: %02d:%02d:%02d", hour(), minute(), second() );
    }
  #endif
}


static void InitUI() {
  tft.clear();
  tft.setRotation( displayRotation );
  tft.fillScreen( TFT_BLACKISH );

  uint16_t* spritePtr = (uint16_t*)sprite.createSprite( tft.width(), tft.height() );
  if( spritePtr == NULL ) {
    log_e("Unable to create spritePtr");
  } else {
    log_n("Successfully created spritePtr");
  }
  sprite.fillSprite( TFT_BLACK );
  uint16_t* logoSpritePtr = (uint16_t*)LogoSprite.createSprite( 32, 32 );
  if( logoSpritePtr == NULL ) {
    log_e("Unable to create logoSpritePtr");
  } else {
    log_n("Successfully created logoSpritePtr");
  }

