tobozo/esp32-DCF77_Analyzer_Clock/UI.h
  TFT_HALFWIDTH = tft.width() / 2;
  TFT_HALFHEIGHT = tft.height() / 2;

  uint16_t centericonposx = ( TFT_HALFWIDTH - 32 / 2 );
  uint16_t centericonposy = ( TFT_HALFHEIGHT - 32 / 2 );

  setFontStyle( &sprite, LedWeekStatusFontStyle );
  getTextBounds( &sprite, "0", &LedWeekStatusFontWidth, &LedWeekStatusFontHeight );

  setFontStyle( &sprite, LedErrorStatusFontStyle );
  getTextBounds( &sprite, "0", &LedErrorStatusFontWidth, &LedErrorStatusFontHeight );

  setFontStyle( &sprite, LedParityStatusFontStyle );
  getTextBounds( &sprite, "0", &LedParityStatusFontWidth, &LedParityStatusFontHeight );

  setFontStyle( &sprite, LedDCFStatusFontStyle );
  getTextBounds( &sprite, "0", &LedDCFStatusFontWidth, &LedDCFStatusFontHeight );

  setFontStyle( &sprite, ErrorsCountFontStyle );
  getTextBounds( &sprite, "0", &ErrorsCountFontWidth, &ErrorsCountFontHeight );

  setFontStyle( &sprite, RingLabelsFontStyle );
  getTextBounds( &sprite, "0", &RingLabelsFontWidth, &RingLabelsFontHeight );

  setFontStyle( &sprite, LedDisplayFontStyle );
  getTextBounds( &sprite, "0", &w, &LedDisplayFontHeight );

  setFontStyle( &sprite,  myRTCDateFontStyle );
  getTextBounds( &sprite, "0", &w, &RTCDateFontHeight );

  setFontStyle( &sprite, BoxSelected->style );
  getTextBounds( &sprite, "LEAP", &LEAPWidth, &h );
  getTextBounds( &sprite, "CET", &CETWidth, &h );
  getTextBounds( &sprite, "CEST", &CESTWidth, &h );
  CESTXpos = tft.width() - ( CESTWidth + 2 );
  CETXPos  = tft.width() - ( CETWidth + 2 + 2 + CESTWidth + 2 );
  LEAPXPos = tft.width() - ( LEAPWidth + 2 );

  #ifdef DCF77_DO_WEATHER
    InitPrefs();
  #endif

  LogoSprite.fillSprite( TFT_BLACKISH );

  setFontStyle( &sprite, LedParityStatusFontStyle );
  getTextBounds( &sprite, "01100101 P", &tmpFontWidth, &tmpFontHeight );
  sprite.fillRect( 0,                                       tft.height() - (LedParityStatusFontHeight + 2), tmpFontWidth - LedParityStatusFontWidth, LedParityStatusFontHeight+1, TFT_LIGHTGRAY );
  sprite.fillRect( tmpFontWidth - LedParityStatusFontWidth, tft.height() - (LedParityStatusFontHeight + 2), LedParityStatusFontWidth + 2,            LedParityStatusFontHeight+1, TFT_ORANGE);
  sprite.setTextColor( TFT_DARKGRAY );
  sprite.drawString( "01100101 P", 1, tft.height() - (LedParityStatusFontHeight + 1)  );

  setFontStyle( &sprite, LedWeekStatusFontStyle );
  getTextBounds( &sprite, "SMTWTFS", &weekDayNamesWidth, &h );
  sprite.fillRect( tft.width() - (weekDayNamesWidth + 3),      tft.height() - (LedWeekStatusFontHeight + 1), weekDayNamesWidth + 3,      LedWeekStatusFontHeight + 2, TFT_LIGHTGRAY );
  sprite.fillRect( tft.width() - (weekDayNamesWidth + 3),      tft.height() - (LedWeekStatusFontHeight + 1), LedWeekStatusFontWidth + 2, LedWeekStatusFontHeight + 2, TFT_ORANGE );
  sprite.fillRect( tft.width() - (LedWeekStatusFontWidth + 2), tft.height() - (LedWeekStatusFontHeight + 1), LedWeekStatusFontWidth + 2, LedWeekStatusFontHeight + 2, TFT_ORANGE );
  sprite.setTextColor( TFT_DARKGRAY );
  sprite.drawString( "SMTWTFS", WeekDayNamesXpos, WeekDayNamesYpos );

  LedParityStatus( 1, -1 ); // H
  LedParityStatus( 2, -1 ); // M
  LedParityStatus( 3, -1 ); // S
  LedDCFStatus( -1 );

  LedWeekStatus( LED_CEST, LOW );
  LedWeekStatus( LED_CET, LOW );
  LedWeekStatus( LED_LEAPYEAR, LOW );

  drawIcon( atomic, centericonposx, centericonposy );

  setRingCoords(); // cache ring coords
  drawRing();

  sprite.pushSprite( 0, 0, TFT_BLACK );
}


void displayData( void ) {
  // display Day of Week on LED's
  // first, clear all the 'Day' Led's before displaying new value
  LedWeekStatus( LED_SUNDAY, LOW );
  LedWeekStatus( LED_MONDAY, LOW );
  LedWeekStatus( LED_TUESDAY, LOW );
  LedWeekStatus( LED_WEDNESDAY, LOW );
  LedWeekStatus( LED_THURSDAY, LOW );
  LedWeekStatus( LED_FRIDAY, LOW );
  LedWeekStatus( LED_SATURDAY, LOW );
  // switch on the Weekday LED
  switch ( dcfWeekDay ) {
    case 1: LedWeekStatus( LED_MONDAY, HIGH ); break;
    case 2: LedWeekStatus( LED_TUESDAY, HIGH ); break;
    case 3: LedWeekStatus( LED_WEDNESDAY, HIGH ); break;
    case 4: LedWeekStatus( LED_THURSDAY, HIGH ); break;
    case 5: LedWeekStatus( LED_FRIDAY, HIGH ); break;
    case 6: LedWeekStatus( LED_SATURDAY, HIGH ); break;
    case 7: LedWeekStatus( LED_SUNDAY, HIGH ); break;
  }
  // display Summer- or Wintertime LED
  if ( dcfDST == 1 ) {
    LedWeekStatus( LED_CET, LOW );
    LedWeekStatus( LED_CEST, HIGH );
  } else {
    LedWeekStatus( LED_CEST, LOW );
    LedWeekStatus( LED_CET, HIGH );
  }
  // display Leap Year LED
  if ( leapYear == 1 ) {
    LedWeekStatus( LED_LEAPYEAR, HIGH );
  } else {
    LedWeekStatus( LED_LEAPYEAR, LOW );
  }
  LedWeekStatus( LED_WEEKNUMBER, weekNumber );
  Serial.printf( "dcfWeekDay: %d, weekNumber: %d, dcfDay: %d, dcfMonth: %d, dcfYear: %d, dcfDST: %d, leapYear: %d\n", dcfWeekDay, weekNumber, dcfDay, dcfMonth, dcfYear, dcfDST, leapYear );
}


void LedTest() {
  // The displays are lit up sequentially because of the current draw.
  // When all is lit up at the same time, you would need a bigger power supply.

  // Outer LED ring
  for ( int i = 0; i < 60; i++ )  { // LED's ON
    setRingLed( LedRingOuter, i, true );
    sprite.pushSprite( 0, 0, TFT_BLACK );
  }
  for ( int i = 59; i >= 0; i-- ) { // LED's OFF
    setRingLed( LedRingOuter, i, false );
    sprite.pushSprite( 0, 0, TFT_BLACK );
  }
  // Inner LED ring
  for ( int i = 0; i < 60; i++ ) { // LED's ON
    setRingLed( LedRingInner, i, true );
    sprite.pushSprite( 0, 0, TFT_BLACK );
  }
  for ( int i = 59; i >= 0; i-- ) { // LED's OFF
    setRingLed( LedRingInner, i, false );
    sprite.pushSprite( 0, 0, TFT_BLACK );
  }
  for ( int i = 22; i <= 53; i++ ) { // LED's ON
    LedWeekStatus( i, HIGH );
    LedErrorStatus( i, HIGH );
    LedParityStatus( (i % 3) + 1, HIGH );
    sprite.pushSprite( 0, 0, TFT_BLACK );
  }
  // wait before turning the LED's off
  delay( LedTest_DELAY_DISPLAYS );
  for ( int i = 53; i >= 22; i-- ) { // LED's OFF
    LedWeekStatus( i, LOW );
    LedErrorStatus( i, LOW );
    LedParityStatus( (i % 3) + 1, LOW );
    sprite.pushSprite( 0, 0, TFT_BLACK );
  }
  LedWeekStatus( LED_WEEKNUMBER, -1 );
  sprite.pushSprite( 0, 0, TFT_BLACK );
}


void initialize(void) {
  M5.begin();

  InitPins();
  InitUI();

  leadingEdge         = 0;
  trailingEdge        = 0;
  previousLeadingEdge = 0;
  bufferPosition      = 0;
  // Reset DCFbitBuffer array, positions 0-58 (=59 bits)
  for ( int i = 0; i < 59; i++ ) {
    DCFbitBuffer[i] = 0;
    DCFbitFinalBuffer[i] = 0;
  }

  initSpeaker();
  initRTC();
  if ( PERFORM_LED_TEST == 1 ) {
    LedTest();
  }
  // activate errorCounter display after LED test
  LedDisplay( DisplayBufferBitError, "R", 0 );
  // spawn tasks
  initTasks();
}


#endif // _UI_H_
